#!/usr/bin/env python3

m1 = ["苹果园","古城","八角游乐园","八宝山","玉泉路","五棵松","万寿路","公主坟","军事博物馆","木樨地","南礼士路",
    "复兴门","西单","天安门西","天安门东","王府井","东单","建国门","永安里","国贸","大望路","四惠","四惠东"]
m2 = ["北京站","崇文门","前门","和平门","宣武门","长椿街","复兴门","阜成门","车公庄","西直门","积水潭","鼓楼大街",
    "安定门","雍和宫","东直门","东四十条","朝阳门","建国门"]
m3 = ["田村","永定路","恩济东街","西钓鱼台","航天桥","白堆子","甘家口","展览路","阜成门","平安里","南锣鼓巷",
    "张自忠路","东四十条","工人体育场","团结湖","朝阳公园","石佛营","星火站","体育中心","平房村","东坝中街",
    "东风","管各庄西","楼梓庄桥西","楼梓庄","高辛庄","曹各庄北"]
m4 = ["安河桥北","北宫门","西苑","圆明园","北京大学东门","中关村","海淀黄庄","人民大学","魏公村","国家图书馆",
    "动物园","西直门","新街口","平安里","西四","灵境胡同","西单","宣武门","菜市口","陶然亭","北京南站","马家堡",
    "角门西","公益西桥","新宫","西红门","高米店北","高米店南","枣园","清源路","黄村西大街","黄村火车站",
    "义和庄","生物医药基地","天宫院"]
m5 = ["天通苑北","天通苑","天通苑南","立水桥","立水桥南","北苑路北","大屯路东","惠新西街北口","惠新西街南口",
    "和平西桥","和平里北街","雍和宫","北新桥","张自忠路","东四","灯市口","东单","崇文门","磁器口","天坛东门",
    "蒲黄榆","刘家窑","宋家庄"]
m6 = ["金安桥","苹果园","苹果园南路","西黄村","廖公庄","田村","海淀五路居","慈寿寺","花园桥","白石桥南","二里沟",
    "车公庄西","车公庄","平安里","北海北","南锣鼓巷","东四","朝阳门","东大桥","呼家楼","金台路","十里堡","青年路",
    "褡裢坡","黄渠","常营","草房","物资学院路","通州北关","通运门","北运河西","北运河东","郝家府","东夏园","潞城"]
m7 = ["北京西站","湾子","达官营","广安门内","菜市口","虎坊桥","珠市口","桥湾","磁器口","广渠门内","广渠门外","双井",
    "九龙山","大郊亭","百子湾","化工","南楼梓庄","欢乐谷景区","垡头","双合","焦化厂","黄厂村","豆各庄","万盛南街西口",
    "云景东路","小马庄","高楼金","环球影城"]
m8 = ["朱辛庄","育知路","平西府","回龙观东大街","霍营","育新","西小口","永泰庄","林萃桥","森林公园南门","奥林匹克公园",
    "奥体中心","北土城","安华桥","安德里北街","鼓楼大街","什刹海","南锣鼓巷","中国美术馆","王府井北","王府井","前门",
    "珠市口","天桥","永定门外","木樨园桥北","木樨园桥南","大红门","大红门桥","和义","西洼地","六营门","五福堂","德茂","瀛海"]
m9 = ["昌平西山口","十三陵景区","昌平","昌平东关","北邵洼","南邵","沙河高教园","沙河","巩华城","朱辛庄","生命科学园","西二旗",
    "清河","上清桥","学清路","六道口","学院桥","西土城","蓟门桥","明光桥西","皂君庙","国家图书馆","白石桥南","白堆子","军事博物馆",
    "北京西站","六里桥东","六里桥","七里庄","丰台东大街","丰台南路","科怡路","丰台科技园","郭公庄"]
m10 = ["巴沟","苏州街","海淀黄庄","知春里","知春路","西土城","牡丹园","健德门","北土城","安贞门","惠新西街南口","芍药居",
    "太阳宫","三元桥","亮马桥","农业展览馆","团结湖","呼家楼","金台夕照","国贸","双井","劲松","潘家园","十里河","分钟寺",
    "成寿寺","宋家庄","石榴庄","大红门","角门东","角门西","草桥","纪家庙","首经贸","丰台站","泥洼","西局","六里桥","莲花桥",
    "公主坟","西钓鱼台","慈寿寺","车道沟","长春桥","火器营"]
# m11 = ["金顶街","金安桥","田顺庄","首钢","古城南街","衙门口","衙门口上街","吴家村","小瓦窑","郑常庄","靛厂","六里桥"]
m12 = ["四季青","远大路","长春桥","苏州桥","人民大学","大钟寺","蓟门桥","北太平庄","马甸桥","安华桥","安贞桥","和平西桥",
    "光熙门","西坝河","三元桥","芳园里","高家园","酒仙桥","北岗子","东风","管各庄西"]
m13 = ["西直门","明光桥西","大钟寺","知春路","五道口","上地","清河","西二旗","龙泽","回龙观","霍营",
    "立水桥","北苑","望京西","芍药居","光熙门","柳芳","东直门"]
m14 = ["张郭庄","园博园","大瓦窑","郭庄子","大井","七里庄","西局","东管头","丽泽商务区","菜户营","西铁营","景风门",
    "北京南站","陶然桥","永定门外","景泰","蒲黄榆","方庄","十里河","北工大西门","平乐园","九龙山","大望路","红庙","金台路",
    "朝阳公园","枣营","东风北桥","将台","高家园","望京南","阜通","望京","东湖渠","来广营","善各庄"]
m15 = ["清华东路西口","六道口","北沙滩","奥林匹克公园","安立路","大屯路东","关庄","望京西","望京",
    "望京东","崔各庄","马泉营","孙河","国展","花梨坎","后沙峪","南法信","石门","顺义","俸伯"]
m16 = ["宛平城","榆树庄","看丹","富丰桥","丰台南路","丰台站","丰益桥南","丽泽商务区","红莲南里","达官营","木樨地",
    "玉渊潭东门","甘家口","二里沟","国家图书馆","万寿寺","苏州桥","苏州街","万泉河桥","西苑","农大南路","马连洼","西北旺",
    "永丰南","永丰","屯佃","稻香湖路","温阳路","北安河"]
m17 = ["未来科技城北区","未来科技城南区","天通苑东","清河营","勇士营","望京西","太阳宫","西坝河","香河园","工人体育场",
    "东大桥","永安里","广渠门外","潘家园西","十里河","朝阳港","北神树","次渠北","次渠","亦庄站前区南"]
# m18 = ["上岸","首钢","银河大街","玉泉路","公主坟","木樨地","金融街","西单","王府井","建国门","国贸","大望路","传媒大学",
#    "管庄","北关","彩虹之门","龙旺庄","宋庄"]
m19 = ["牡丹园","北太平庄","积水潭","平安里","金融街","牛街","景风门","草桥","新发地","新宫"]
# m21 = ["黄村火车站","磁各庄","瀛海","鹿海园","马驹桥","亦庄火车站","大稿南","西小马","通州火车站","通运门","耿庄",
#    "徐辛庄","李家桥","双河大街","顺义","马坡","牛栏山"]
m22 = ["东风北桥","北岗子","曹各庄北","宋庄","燕郊北","三河西","马坊","马昌营","平谷西","平谷","泃河湾"]
mfsh = ["丰益桥南","首经贸","四环路","樊羊路","郭公庄","大葆台","稻田","长阳","篱笆房","广阳城","良乡大学城北",
    "良乡大学城","良乡大学城西","良乡南关","苏庄","阎村北"]
mbt = ["四惠","四惠东","高碑店","传媒大学","双桥","管庄","八里桥","通州北苑","果园","九棵树","梨园","临河里","土桥","环球影城"]
myzh = ["宋家庄","肖村","小红门","旧宫","亦庄桥","亦庄文化园","万源街","荣京东街","荣昌东街","同济南路","经海路",
    "次渠南","次渠","亦庄火车站"]
myf = ["阎村北","大紫草坞","阎村","星城","顾八路","饶乐府","老城区北","燕化"]
myfzh = ["饶乐府","老城区","顾册","周口店"]
mxj = ["香山","植物园","万安公墓","玉泉郊野公园","颐和园西门","颐和园南门","巴沟"]
mmtg = ["石门营","小园","矿务局","上岸村","石龙路","四道桥","金安桥","苹果园"]
# myq = ["八大处公园","实兴北街","亚疗桥","巨山村","田村北","田村","金沟河","玉泉路","莲玉桥","小瓦窑","小屯","郭庄子",
#    "五里店","程庄子","杜家场","看丹","丰台科技园","五圈"]

mcbd = ["东大桥","万通中心","京广桥","光华路","核心区","北京电视中心","乐城公馆","九龙山"]

#######################################
all_lines = (m1, m2, m3, m4, m5, m6, m7, m8, m9, m10, m12, m13, m14, m15, m16, m17, m19, m22, mfsh, mbt,
    myzh, myf, myfzh, mxj, mmtg)

cyclic_lines = (m2, m10)
